mod processor;
use processor::Processor;

fn main() {
    let mut emulator = Processor::new();

    //
    // 0b110011_0000_00001_00011_01010101010
    //   ^^^^^^ ^^^^ ^^^^^ ^^^^^ ^^^^^^^^^^^
    //   opcode rg   rs1   rs2   imm

    let program = vec![
        0b110011_0000_00001_00011_01010101010, // ADD 0 1 (добавляем 1 в регистр 0)
        0b110011_0001_00111_00011_01010101010, // ADD 1 7 
        0b110000_0001_00011_00001_01010101010, // SUB 1 3 (вычитаем 3 из регистра 1)
        0b100011_0000_00001_00001_00000000001, // STORE 1 1 1 (в ячейку памяти 1 кладем значение регистра 1)
        0b000011_0010_00001_00000_00000000001 // LOAD 2 1 (вытаскиваем из ячейки памяти 2 в регистр 1)
    ];
    
    emulator.load_program(&program);
    println!();
    emulator.execute();
}
